{
  "coronavirus": {
    "backgroundColor": "#3647a5",
    "brief": "AndroidMakers 2020 & Coronavirus...",
    "content": "<h1>Android Makers 2020 &amp; Coronavirus</h1><<br><h2>FR : Information Coronavirus :</h2><br><p>Android Makers maintient ses dates d’événement<br> La conférence se tiendra les 20 &amp; 21 Avril 2020 au Beffroi de Montrouge (92)<br> Avec moins de 900 personnes présentes chaque journée, Android Makers n’est aujourd’hui pas restreint ou repoussé par la décision du Ministère de la Santé prononcée le 08 Mars 2020.<br> Nous tenons compte de l’évolution de la situation ainsi que des recommandations officielles, mais prendrons également des mesures supplémentaires pour préserver la sécurité des participants, orateurs et partenaires présents.<br>Nous recommandons vivement à tous les participants de prévoir des assurances d’annulation pour vos réservations de voyage en cas d’annulation officielle de la part des autorités.<br>En ce qui concerne les billets déjà achetés, il sera possible de vous les faire rembourser directement sur Eventbrite, jusqu’à la veille de l’événement (19/04/2020).<br>Nous communiquerons auprès de chacun des participants afin de leur rappeler les précautions de rigueur, en particulier s’ils ont voyagé dans des zones à risque en fonction des dernières actualités. Nous prenons bien conscience de la situation ainsi que ses évolutions, et n’hésiterons pas à prendre les dispositions nécessaires pour protéger les personnes (nous sommes à titre d’êtres humains tout aussi concernés que vous par cette situation)<br> Nous vous tiendrons informé, et mettrons à jour cette page si nécessaire.<br>Merci pour votre compréhension</p><br><h2>EN: Android Makers Stands</h2><br><p>Android Makers is scheduled for April 20th &amp; 21th, 2020 at the Beffroi de Montrouge (92)<br> With less than 900 people per day, we are not concerned by the decision of the Ministry of Health of March 8, 2020 which cancels any events with more than 1000 attendees).<br> However, we are taking measures to limit the exposure and to guaranty the safety of our attendees, speakers and exhibitors as much as possible.<br> We’ve also contacted the speakers to remind them of the government’s first recommendations, especially if they have travelled to exposed areas depending on the latest news.<br>We highly recommend to any participant to subscribe to a cancelation insurance for their travel and accommodation in order to prevent an official cancellation from the authorities<br>For those who already bought a ticket, it will be possible to get a refund until 1 day before the event occurrence (2020/04/19), directly via Eventbrite.<br> We will communicate to any participant and staff member the prevention measures, also recommended by the government authorities.<br> We will keep you updated as well and will update this page if necessary.<br>Thank you for your comprehension</p>",
    "image": "/images/posts/IMG_2249.jpg",
    "published": "2020-03-09",
    "source": "/data/posts/2020-03-03-coronavirus.md",
    "title": "AndroidMakers 2020 & Coronavirus"
  }
}