{
  "cfp": {
    "backgroundColor": "#3647a5",
    "brief": "What better way to start the year than drafting a proposal to share your experience with the awesome Android community? The CFP is op...",
    "content": "<h1>CFP is open! (Happy New Year!)</h1><p>The Android Makers team wishes you a very happy new year!🍾 We hope 2019 will bring you happy users, faster apps, plenty of technical challenges and cool Android discoveries! And faster build times too! But above all a lot of joy and happiness for 2019.</p><p>And what better way to start the year than drafting a proposal to share your experience with the awesome Android community :)? The CFP is open and accepts submissions until <strong>January 21st</strong>. </p><p>Below are a few steps if you want to submit a proposal. If anything is unclear or if you have any question, feel free to reach out at contact@androidmakers.fr. </p><p>Looking forward to seeing you on stage in April! </p><h2>1. Find a topic</h2><p>We're very open about the topics as long as they are Android development related. A very technical talk about coroutines-generated bytecode is great. A case study about how you redesigned your app UI/UX is great too. So is a talk about how you organize your team/continuous integration/git repo. </p><p>If you're using Android inside an IOT device, that's awesome. And if you scaled your team to dozens or engineers or managed to release an app as an indie dev, we'd love to hear about it as well. You get the idea, if you like what you do, other will too! Come talk about it.</p><p><plastic-image alt=\"Britt Barak - Who’s afraid of Machine Learning? First steps with TensorFlow for Android. - apr. 23rd, 2018\" srcset=\"/images/posts/cfp-1.jpg\" lazy-load preload fade></plastic-image></p><h2>2. Find a talk format</h2><p>We have two main formats for talks:</p><ul><li>20 min for quick talks</li><li>40 min to go into more details</li></ul><p>Pick the one you prefer. If you're flexible enough to make your talk fit in 20 or 40 min, let us know, that will simplify planning!</p><p>In addition to talks, there are also other ways to participate: </p><ul><li>Workshops: a workshop lasts between 1h and 3h and usually involves walking through code with a smaller audience</li><li>Office hours: 1-1 interactions with the participants where you can answer questions about your areas of expertise</li><li>Maker stand: If you're a maker and have something cool to showcase.</li></ul><p><plastic-image srcset=\"/images/posts/cfp-2.jpg\" lazy-load preload fade></plastic-image></p><h2>3. Go to https://cfp.androidmakers.fr</h2><p>Now is the time to submit your proposal! Make sure to put as many details as possible and a nice picture of yourself so that participants get to know you! </p><p>Choose a title for your talk that stands out and allows attendees to get a grasp of what the talk is about. Give some more details in the description. If you already have slides or a video, link them too. That will help the jury make an informed decision. </p><p>When everything's done and clear, press the 'submit' button!</p><p><plastic-image alt=\"Christina Lee - The State of Representing State - apr. 23rd, 2018\" srcset=\"/images/posts/cfp-3.jpg\" lazy-load preload fade></plastic-image></p><h2>4. Wait (but not long)</h2><p>After the CFP closes, the propositions are evaluated by the selection committee. The committee is composed by 6-7 passioned and experienced Android developers. Selection criterion are multiple. We want the best talks for the conference and also a rich agenda for the attendees. That means your experience as a speaker counts as well as the contents of your talk obviously. But also what topic you submitted. </p><p>To improve your chances of being selected, pick a short but meaningful title, polish your slides and practice!</p><p>In all cases, the committee will reach out shortly after the cfp closes.</p><p><plastic-image alt=\"Yannick Badoual - Dagger-android, under the hood - apr. 24th, 2018\" srcset=\"/images/posts/cfp-4.jpg\" lazy-load preload fade></plastic-image></p><h2>5. Come and enjoy the conference!</h2><p>That's it, you're done! Whether you're selected or not, we sincerely hope you'll enjoy Android Makers 2019! </p><p>Can't wait to see you in April!</p>",
    "image": "/images/posts/cfp.jpg",
    "published": "2019-01-02",
    "source": "/data/posts/2019-01-02-cfp.md",
    "title": "Call for Papers is open!"
  },
  "selecting-speakers": {
    "backgroundColor": "#3647a5",
    "brief": "In order to be more transparent, the selection committee for Android Makers 2019 will explain the process behind how we built the agenda...",
    "content": "<h1 id=\"selectingspeakersforandroidmakers2019\">Selecting Speakers for Android Makers 2019</h1><p>In order to be more transparent, the selection committee for Android Makers 2019 will explain the process behind how we built the agenda for our conference.</p><p>This post has been written by  <a href=\"https://twitter.com/loutry\">Marion Hayoun</a>,  <a href=\"https://twitter.com/Djava7\">Djavan Bertrand</a>,  <a href=\"https://twitter.com/stan_kocken\">Stan Kocken</a>and  <a href=\"https://twitter.com/Eyal_Lezmy\">Eyal Lezmy</a>. We also want to give a special thanks to  <a href=\"https://twitter.com/mikewolfson\">Mike Wolfson</a>  for reviewing this article!</p><h3 id=\"thecommittee\">The committee</h3><p>The committee is the group that decided which talks will be on the agenda. It is composed by 6 developers:</p><ul><li><a href=\"https://twitter.com/Djava7\">Djavan Bertrand</a>, iOS developer at Tag Heuer</li><li><a href=\"https://twitter.com/loutry\">Marion Hayoun</a>, Android developer at Canal+</li><li><a href=\"https://twitter.com/stan_kocken\">Stan Kocken</a>, Android lead developer at Dashlane</li><li><a href=\"https://twitter.com/Eyal_Lezmy\">Eyal Lezmy</a>, Android developer at Tag Heuer and Google Developer Expert</li><li><a href=\"https://twitter.com/Nilhcem\">Gautier Mechling</a>, Android developer at Innovorder and Google Developer Expert</li><li><a href=\"https://twitter.com/n0tnull\">Adrien Vitti</a>, Android developer at Smart&amp;Soft</li></ul><p>Most of the committee are organizers of the Paris Android User Group. The event is co-organized with BeMyApp.</p><h4 id=\"theroleofthecommittee\">The role of the committee</h4><p>The mission of this group was to:</p><ul><li>ensure interesting topics</li><li>keep quality high</li><li>ensure a variety of topics</li><li>keep the level of the talks properly adapted to the audience;</li><li>encourage inclusion and diversity</li></ul><p>We tried to forecast the trending topics so that our audience would be well prepared for them. We sometimes have hints that a given technology/product will be soon deprecated. In this case, we avoided selecting talks about that subject. If we think that a technology will be growing, we tried to get more content about that.</p><h3 id=\"part1callforpapers\">Part 1: Call For Papers</h3><p>How did we get so many great speakers for a 2 days conference?</p><p>First, we opened a “call for paper” (CFP) website. This is a place where speakers from all over the world,...</p><p>Read the full article <a href=\"https://medium.com/@androidmakers_fr/selecting-speakers-for-android-makers-2019-b8a4012464d7\">on Medium</a></p>",
    "image": "/images/posts/selecting-speakers.jpg",
    "published": "2019-03-18",
    "source": "/data/posts/2019-03-18-selecting-speakers.md",
    "title": "Selecting Speakers"
  },
  "office-hours" : {
    "backgroundColor" : "#3647a5",
    "brief" : "During this year event, we are going to have some Office hours lead by experts on specific topics. You are all invited to join these office hours...",
    "content" : "<h1 id=\"androidmakers2019willhostsomeofficehours\">AndroidMakers 2019 will host some \"Office hours\"</h1><p>During this year event, we are going to have some Office hours lead by experts on specific topics. You are all invited to join these office hours to ask them any question about their area of expertise.</p><h2 id=\"whataretheofficehours\">What are the office hours?</h2><p>The office hours will gather some speakers to answer your questions on specific topics.<br/>Each session will last 50 minutes and will be lead by two speakers within their field of expertise. Everyone can join, talk and ask them about specific problems they encountered.</p><h2 id=\"whenaretheyorganized\">When are they organized?</h2><p>Wednesday 11h15<br/><strong>Ben Weiss</strong>: Dynamic Delivery, Modularization, Instant Apps<br/><strong>Adrien Vitti</strong>: Analytics</p><p>Wednesday 12h05<br/><strong>Kai Koenig</strong>: In-app-billing, Webview, Libraries/Modules<br/><strong>Lorica Claesson</strong>: UX</p><p>Wednesday 14h00<br/><strong>Rebecca Franks</strong>: Animations<br/><strong>Nick Butcher</strong>: UI, Animation, Vector assets, Material Design, Dark Mode, ConstraintLayout</p><p>Wednesday 14h50<br/><strong>John Hoford &amp; Nicolas Roard</strong>: ConstraintLayout, MotionLayout</p><p>Wednesday 16h00<br/><strong>Louis CAD</strong>: Coroutines, Gradle Kotlin DSL, library development, Domain Driven Development, Bluetooth Low Energy, Camera2 API, Kotlin Multiplatform<br/><strong>Eyal LEZMY</strong>: Navigation Component, Gradle plugins, ADB, AOSP, CI infrastructure</p><p>As you can see there, one session have multiple experts and each host has a field of expertise.<br/>You can go and meet them whenever you want during their sessions.</p><h2 id=\"whatdoineed\">What do I need?</h2><p>You need to have your questions ready. You can bring drawings, wireframes, or even your laptop.<br/>If too many people want to talk to the expert, please limit the number of your questions.</p>",
    "image" : "/images/posts/IMG_2249.jpg",
    "published" : "2019-04-08",
    "source" : "/data/posts/2019-04-08-office-hours.md",
    "title" : "AndroidMakers 2019 will host some \"Office hours\""
  },
  "app" : {
    "backgroundColor" : "#3647a5",
    "brief" : "Every tech conference must have its dedicated application. Android Makers is not an exception, that’s why we suggest you to download the Android Makers app directly on Google Play now and prepare your agenda...",
    "content" : "<h2 id=\"downloadtheandroidmakers2019app\">Download the Android Makers 2019 app! 📱</h2><p>Every tech conference must have its dedicated application.\nAndroid Makers is not an exception, that’s why we suggest you to download the Android Makers app directly on Google Play now and prepare your agenda.</p><p><a href='https://play.google.com/store/apps/details?id=fr.paug.androidmakers&amp;pcampaignid=MKT-Other-global-all-co-prtnr-py-PartBadge-Mar2515-1'><img alt='Get it on Google Play' src='https://play.google.com/intl/en_us/badges/images/generic/en_badge_web_generic.png'/></a></p><p>It's split in 3 sections:</p><p>The 2 days schedule\nVenue Informations\nAbout and list of our partners</p><h1 id=\"theschedule\">The schedule</h1><p>All sessions of the Android Makers event will be held in three rooms of the venue. From the application, you can know which sessions are next at a glance.</p><p>Within the app, you are also able to filter the session by their language and make you own schedule by selecting the sessions you are interested in. A notification will be sent when a selected session is about to start.</p><h1 id=\"venueinfo\">Venue info</h1><p>Access information to the venue are given, along the map of the venue, and information about the afterparty. </p><p>For iOS or other OS users, we invite you to use our website directly :)</p><p>See you soon!</p>",
    "image" : "/images/venues/venue_0.jpg",
    "published" : "2019-04-15",
    "source" : "/data/posts/2019-04-15-app.md",
    "title" : "Download the Android Makers 2019 app!"
  }
}