{
  "coronavirus": {
    "backgroundColor": "#3647a5",
    "brief": "AndroidMakers 2020 & Coronavirus...",
    "content": "<h1>Android Makers 2020 &amp; Coronavirus</h1><h2>FR : Information Coronavirus :</h2><p>Android Makers maintient ses dates d’événement<br>La conférence se tiendra les 20 &amp; 21 Avril 2020 au Beffroi de Montrouge (92)<br>Avec moins de 900 personnes présentes chaque journée, Android Makers n’est aujourd’hui pas restreint ou repoussé par la décision du Ministère de la Santé prononcée le 29 février 2020.<br>Nous tenons compte de l’évolution de la situation ainsi que des recommandations officielles, mais prendrons également des mesures pour préserver la sécurité des participants, orateurs et partenaires présents.<br>Nous communiquerons auprès de chacun des participants afin de leur rappeler les précautions de rigueur, en particulier s’ils ont voyagé dans des zones à risque en fonction des dernières actualités.<br>Nous vous tiendrons informé, et mettrons à jour cette page si nécessaire.</p><h2>EN: Android Makers Stands</h2><p>Android Makers is scheduled for April 20th &amp; 21th, 2020 at the Beffroi de Montrouge (92)<br>With less than 900 people per day, we are not concerned by the decision of the Ministry of Health of February 29, 2020 which cancels any events with more than 5000 attendees).<br>However, we are taking measures to limit the exposure and to guaranty the safety of our attendees, speakers and exhibitors as much as possible.<br>We’ve also contacted the speakers to remind them of the government’s first recommendations, especially if they have travelled to exposed areas depending on the latest news.<br>We will communicate to any participant and staff member the prevention measures, also recommended by the government authorities. We will keep you updated as well and we will update this page if necessary.</p>",
    "image": "/images/posts/IMG_2249.jpg",
    "published": "2020-03-03",
    "source": "/data/posts/2020-03-03-coronavirus.md",
    "title": "AndroidMakers 2020 & Coronavirus"
  }
}