{
  "coronavirus": {
    "backgroundColor": "#3647a5",
    "brief": "AndroidMakers 2020 & Coronavirus...",
    "content": "<h1>Android Makers 2020 &amp; Coronavirus</h1><br><h2>FR : Information Coronavirus :</h2><br><p>Android Makers maintient ses dates d’événement<br> La conférence se tiendra les 20 &amp; 21 Avril 2020 au Beffroi de Montrouge (92)<br> Avec moins de 900 personnes présentes chaque journée, Android Makers n’est aujourd’hui pas restreint ou repoussé par la décision du Ministère de la Santé prononcée le 08 Mars 2020.<br> Nous tenons compte de l’évolution de la situation ainsi que des recommandations officielles, mais prendrons également des mesures supplémentaires pour préserver la sécurité des participants, orateurs et partenaires présents.<br>Nous recommandons vivement à tous les participants de prévoir des assurances d’annulation pour vos réservations de voyage en cas d’annulation officielle de la part des autorités.<br>En ce qui concerne les billets déjà achetés, il sera possible de vous les faire rembourser directement sur Eventbrite, jusqu’à la veille de l’événement (19/04/2020).<br>Nous communiquerons auprès de chacun des participants afin de leur rappeler les précautions de rigueur, en particulier s’ils ont voyagé dans des zones à risque en fonction des dernières actualités. Nous prenons bien conscience de la situation ainsi que ses évolutions, et n’hésiterons pas à prendre les dispositions nécessaires pour protéger les personnes (nous sommes à titre d’êtres humains tout aussi concernés que vous par cette situation)<br> Nous vous tiendrons informé, et mettrons à jour cette page si nécessaire.<br>Merci pour votre compréhension</p><br><h2>EN: Android Makers Stands</h2><br><p>Android Makers is scheduled for April 20th &amp; 21th, 2020 at the Beffroi de Montrouge (92)<br> With less than 900 people per day, we are not concerned by the decision of the Ministry of Health of March 8, 2020 which cancels any events with more than 1000 attendees).<br> However, we are taking measures to limit the exposure and to guaranty the safety of our attendees, speakers and exhibitors as much as possible.<br> We’ve also contacted the speakers to remind them of the government’s first recommendations, especially if they have travelled to exposed areas depending on the latest news.<br>We highly recommend to any participant to subscribe to a cancelation insurance for their travel and accommodation in order to prevent an official cancellation from the authorities<br>For those who already bought a ticket, it will be possible to get a refund until 1 day before the event occurrence (2020/04/19), directly via Eventbrite.<br> We will communicate to any participant and staff member the prevention measures, also recommended by the government authorities.<br> We will keep you updated as well and will update this page if necessary.<br>Thank you for your comprehension</p>",
    "image": "/images/posts/IMG_2249.jpg",
    "published": "2020-03-09",
    "source": "/data/posts/2020-03-03-coronavirus.md",
    "title": "AndroidMakers 2020 & Coronavirus"
  },
  "coronavirus-update": {
    "backgroundColor": "#3647a5",
    "brief": "AndroidMakers 2020 & Coronavirus Update",
    "content": "<h2>Version FR</h2><br /><br />L'évolution rapide du virus Covid-19 en France nous pousse à modifier la conférence Android Makers dans son édition 2020. Lors de ces dernières semaines nous avons beaucoup discuté entre nous de ce que nous devions faire pour l'intérêt de la communauté. Nous ne voulions pas annuler cette conférence prématurément sans avoir de visibilité concrète sur la suite. Cependant la fin de semaine dernière a été décisive pour nous : le nombre de cas en France a fortement augmenté et des mesures de restrictions ont été mise en place. Il n’était pas concevable dans le contexte actuel de faire venir plusieurs centaines de personnes dans un endroit clos comme nous en avons l'habitude. Suite à cette décision nous avons dû évaluer nos options.<br /><br />Le report a évidemment été la première hypothèse que nous avons envisagé. Cependant cette option dépend des disponibilités de notre salle de conférence et aurait reporté l’événement au dernier semestre 2020. Nous voulons vraiment que l’édition 2021 d’Android Makers ait lieu de nouveau en avril et avons donc exclu cette option qui aurait fortement complexifié et impacté négativement les prochaines éditions.<br /><br />L'annulation de l'événement était la solution que nous souhaitions éviter. Nous avons beaucoup travaillé pour préparer l'événement, vous étiez nombreux à vouloir avoir cette conférence, nos speakers étaient impatients de pouvoir présenter leurs sujets favoris et nos fidèles sponsors débordaient déjà d’idées d’animation. Nous avons décidé de se servir de cette situation pour innover, et pour la première fois, de vous proposer une nouvelle expérience : Virtual Android Makers.<br /><br /><br />Nouveau format, même contenu : 2 jours de conférences pour découvrir et redécouvrir les derniers usages et nouveautés des professionnels de la plateforme Android. Que ce soit de chez vous ou de votre travail.<br /><br />Vous pourrez échanger en temps réel avec vos speakers, utiliser le replay pour profiter d’un maximum de session ou re-visionner les dernières explications. Vous pourrez également interagir avec vos speakers, poser des questions à la fin des talks et également planifier des Office-Hours individualisé directement avec certains. Vous l’aurez compris, nous ferons tout notre possible pour garder l’esprit communautaire.<br /><br /><br />Comment pouvons nous faire cela en si peu de temps ? Nous allons utiliser une plateforme que BeMyApp a déjà développée et qui a déjà fait ses preuves sur certains de leurs grands évènements à distance. Nous sommes convaincus que cette plateforme offrira une très bonne expérience pour les speakers ainsi que pour vous.<br /><br /><b>Billetterie</b><br /><br />Avec ce changement, nous avons décidé de mettre à jour le prix du ticket pour cet évènement virtuel : les billets seront donc à 80 euros.<br />Si vous aviez déjà votre billet, il sera converti en ticket pour Virtual Android Makers (vous le recevrez plus tard) et nous vous offrons -50% sur le billet de l'édition 2021 (sur place cette fois 🤞!). Sinon, vous pouvez toujours annuler ce billet, et ce jusqu'au 19 avril.<br /><br />Nous reviendrons très vite vers vous avec le nouveau programme et la liste des speakers qui ont pu nous suivre dans notre démarche.<br /><br />Encore merci pour votre confiance,<br /><br />L'équipe d'Android Makers<br /><br /><br /><h2>EN version</h2><br /><br />The quick evolution of the Covid-19 virus has led to us modifying the Android Makers 2020 edition. During the past few weeks, we have had a lot of discussion between us about what we should do for this event and the awesome attendees. We did not want to cancel the conference too quickly without having a strong grasp on how the situation would evolve.<br /><br />However, last week has been decisive for us: the virus has spread in France and the government has taken measures to limit the spread. In this context, asking 800 people to congregate at the event is not possible. Following this decision we had to think about the remaining options.<br />Finding a new date has been the first option we considered. We really want to have a perfect Android Makers 2021 (in April, as usual) and making an Android Makers 2020 in October/November would make it too hard to organize.<br /><br />Event cancellation is something we wanted to avoid. We have worked a lot to prepare the event, our speakers have submitted outstanding talks, our sponsors have prepared amazing entertainment, and you were so many to be eager to attend the conference. We decided to take advantage of this situation and, for the first time, we present a new experience: The Virtual Android Makers. <br /><br />The idea is still the same: to bring to you the world class experts in Android for 2 days of sessions and other exciting formats, but this time you’ll be in the comfort of your own home.<br />You’ll be able to interact with speakers and attendees, ask questions during a talk and even have one-to-one office hours with our curated specialists. We are going to do everything we can to keep the community spirit, and we have a lot of ideas.<br /><br />How will we be able to do that in such a short amount of time? We are going to use a platform BeMyApp has been developing for a while now, which is frequently used for big “in remote” events. We are firmly convinced that it will offer a great remote experience to the speakers and the attendees.<br /><br /><b>Ticketing</b><br /><br />With this change, we decided to keep a fair and affordable price for this virtual event. The ticket for the 2 days conference is now 80 euros.<br />If you already had your Android Makers ticket, it will be converted to a Virtual Android Makers ticket (you will receive the Virtual Android Makers ticket at a later date) and we will send you a 50% discount for the Android Makers 2021 ticket (on site this time 🤞 ). Otherwise, you can get a refund for your ticket until April 19th.<br />We will get back to you soon with the speaker list and the new schedule.<br /><br />Thanks again for your trust!<br /><br />The Android Makers Team<br /><br /><br />",
    "image": "/images/posts/IMG_2249.jpg",
    "published": "2020-03-16",
    "source": "/data/posts/2020-03-16-coronavirus-update.md",
    "title": "AndroidMakers 2020 & Coronavirus: Update"
  },
  "about-bitrise": {
    "backgroundColor": "#3647a5",
    "brief": "About Bitrise",
    "content": "Bitrise is the world's only purpose built mobile DevOps platform. Its continuous integration and delivery platform speeds up tens of thousands of development processes for the world's fastest growing scaleups, open source projects and established enterprise companies alike. Founded in 2015, with offices in Budapest, London, San Francisco and Boston, Bitrise now powers over a billion app installs a month.<br><br>Hey, it's Viktor from Bitrise, nice to e-meet you on this amazing virtual conference!<br><br>We are here to have great conversations, so feel free to contact us via ‘Office hours' if you want to discuss anything related to your mobile development processes.<br><br>Bitrise helps you develop and operate mobile applications by offering a complete CI/CD platform, built and optimized for Mobile DevOps. By automating mobile development and operational processes on Bitrise, teams deliver faster and improve quality, while increasing productivity. Bitrise provides unrivaled flexibility and power by connecting to all the tools and services you use from one, easy-to-learn platform.<br><br>Bitrise accelerates your velocity by automating common tasks and configuration, decreasing the average time to set up CI/CD for your mobile projects by over 90% compared to commonly used on-premise solutions. A growing library of integrations with tools and services ensures that most steps in your unique development process will be configured quickly, while offering extensive, powerful tools to facilitate your requirements not covered in the library. After configuration, constant updates to steps and integrations ensure that unexpected troubleshooting of your workflows is reduced to an absolute minimum and - instead - your teams focus on delivering.<br><br>Built for mobile, Bitrise is continuously innovating to further reduce friction in your mobile development processes by offering tools, features and services from a single screen and a single shared context for your org. Over 100,000 mobile developers and thousands of organizations worldwide trust Bitrise to accelerate and improve their development processes, including Virgin, Mozilla, Sixt, Just Eat, Careem and Get Your Guide.‎<br><br>-> Check out other videos: How to configure Steps and Workflows for Android Apps - https://www.youtube.com/watch?v=H_qhsdSo4I8<br><br>-> Tutorials for Android Users: https://www.youtube.com/playlist?list... ‎<br><br>  ‎-> Check out our website: www.bitrise.io<br><br>Thank you so much for having us here and we hope you'll have an amazing time on Virtual Android Makers!",
    "image": "/images/logos/bitrise.png",
    "published": "2020-04-18",
    "source": "/data/posts/bitrise.md",
    "title": "About Bitrise"
  }
}