{
  "cfp": {
    "backgroundColor": "#3647a5",
    "brief": "What better way to start the year than drafting a proposal to share your experience with the awesome Android community? The CFP is op...",
    "content": "<h1>CFP is open! (Happy New Year!)</h1><p>The Android Makers team wishes you a very happy new year!🍾 We hope 2019 will bring you happy users, faster apps, plenty of technical challenges and cool Android discoveries! And faster build times too! But above all a lot of joy and happiness for 2019.</p><p>And what better way to start the year than drafting a proposal to share your experience with the awesome Android community :)? The CFP is open and accepts submissions until <strong>January 21st</strong>. </p><p>Below are a few steps if you want to submit a proposal. If anything is unclear or if you have any question, feel free to reach out at contact@androidmakers.fr. </p><p>Looking forward to seeing you on stage in April! </p><h2>1. Find a topic</h2><p>We're very open about the topics as long as they are Android development related. A very technical talk about coroutines-generated bytecode is great. A case study about how you redesigned your app UI/UX is great too. So is a talk about how you organize your team/continuous integration/git repo. </p><p>If you're using Android inside an IOT device, that's awesome. And if you scaled your team to dozens or engineers or managed to release an app as an indie dev, we'd love to hear about it as well. You get the idea, if you like what you do, other will too! Come talk about it.</p><p><plastic-image alt=\"Britt Barak - Who’s afraid of Machine Learning? First steps with TensorFlow for Android. - apr. 23rd, 2018\" srcset=\"/images/posts/cfp-1.jpg\" lazy-load preload fade></plastic-image></p><h2>2. Find a talk format</h2><p>We have two main formats for talks:</p><ul><li>20 min for quick talks</li><li>40 min to go into more details</li></ul><p>Pick the one you prefer. If you're flexible enough to make your talk fit in 20 or 40 min, let us know, that will simplify planning!</p><p>In addition to talks, there are also other ways to participate: </p><ul><li>Workshops: a workshop lasts between 1h and 3h and usually involves walking through code with a smaller audience</li><li>Office hours: 1-1 interactions with the participants where you can answer questions about your areas of expertise</li><li>Maker stand: If you're a maker and have something cool to showcase.</li></ul><p><plastic-image srcset=\"/images/posts/cfp-2.jpg\" lazy-load preload fade></plastic-image></p><h2>3. Go to https://cfp.androidmakers.fr</h2><p>Now is the time to submit your proposal! Make sure to put as many details as possible and a nice picture of yourself so that participants get to know you! </p><p>Choose a title for your talk that stands out and allows attendees to get a grasp of what the talk is about. Give some more details in the description. If you already have slides or a video, link them too. That will help the jury make an informed decision. </p><p>When everything's done and clear, press the 'submit' button!</p><p><plastic-image alt=\"Christina Lee - The State of Representing State - apr. 23rd, 2018\" srcset=\"/images/posts/cfp-3.jpg\" lazy-load preload fade></plastic-image></p><h2>4. Wait (but not long)</h2><p>After the CFP closes, the propositions are evaluated by the selection committee. The committee is composed by 6-7 passioned and experienced Android developers. Selection criterion are multiple. We want the best talks for the conference and also a rich agenda for the attendees. That means your experience as a speaker counts as well as the contents of your talk obviously. But also what topic you submitted. </p><p>To improve your chances of being selected, pick a short but meaningful title, polish your slides and practice!</p><p>In all cases, the committee will reach out shortly after the cfp closes.</p><p><plastic-image alt=\"Yannick Badoual - Dagger-android, under the hood - apr. 24th, 2018\" srcset=\"/images/posts/cfp-4.jpg\" lazy-load preload fade></plastic-image></p><h2>5. Come and enjoy the conference!</h2><p>That's it, you're done! Whether you're selected or not, we sincerely hope you'll enjoy Android Makers 2019! </p><p>Can't wait to see you in April!</p>",
    "image": "/images/posts/cfp.jpg",
    "published": "2019-01-02",
    "source": "/data/posts/2019-01-02-cfp.md",
    "title": "Call for Papers is open!"
  }
}