{
  "registration": {
    "description": "Registration of participants will begin on Monday April 23rd, from 8:00 a.m. in the entrance hall. For registration it is mandatory to carry the eventbrite ticket.",
    "icon": "registration",
    "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fregistration.jpg?alt=media&token=27328646-d323-4cca-904c-75f021bc3ffe",
    "title": "Gates open / Registration",
    "tags": [
      "Service"
    ]
  },
  "lunch": {
    "description": "Fooooood!\nThe best time to talk with speakers and attendees",
    "icon": "lunch",
    "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Flunch.jpg?alt=media&token=bc82aaff-92cc-4dcc-a00e-2b6f30a40225",
    "title": "Lunch",
    "tags": [
      "Service"
    ]
  },
  "break": {
    "description": "Coffeeeeeee!",
    "icon": "coffee-break",
    "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fcoffee-break.jpg?alt=media&token=7c2c929b-cb94-4be8-a05a-b3f678136cb7",
    "title": "Coffee break",
    "tags": [
      "Service"
    ]
  },
  "party": {
    "description": "Let's talk and drink!\n\nFrom 19:00, come for chat, networking, drinks and food!",
    "icon": "party",
    "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fparty.jpg?alt=media&token=8e413f01-373a-40bf-bb87-1dcf1d8e6af1",
    "title": "Makers Party!",
    "tags": [
      "Service"
    ]
  },
  "opening": {
    "description": "Come early and choose the best seat",
    "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fclosing.jpg?alt=media&token=f02d014a-09ee-407e-88c7-b74093e00fed",
    "title": "Opening",
    "tags": [
      "Service"
    ]
  },
  "closing": {
    "description": "Thank you and see you next year!",
    "image": "https://firebasestorage.googleapis.com/v0/b/hoverboard-experimental.appspot.com/o/images%2Fbackgrounds%2Fclosing.jpg?alt=media&token=f02d014a-09ee-407e-88c7-b74093e00fed",
    "title": "Thank you!",
    "tags": [
      "Service"
    ]
  },
  "tbd": {
    "speakers": [
      "a14457ee24a86a604c55d6774bed5483b630e78f"
    ],
    "description": "TBD",
    "language": "TBD",
    "title": "TBD",
    "complexity": "TBD",
    "tags": [
      "Android Development"
    ]
  },
  "FVI-2317": {
    "speakers": [
      "379c162aac12eca2deca690287b54ad270cc2e40",
      "4a7ca4c16cbe81a612bf3011a3d3439f85408103"
    ],
    "title": "Kotlin Under the Covers",
    "language": "English",
    "description": "Kotlin offers many powerful language features that make it a welcome addition to the Android developer's toolkit. But some of these features may do significant work behind the scenes, including allocating object and reflection. This dynamic is not obvious from the Kotlin code, so how do we know when this is happening? This talk will go over some of these areas that you should be aware of, as well as the tools that help us discover this kind of information about our code.",
    "complexity": "Intermédiaire",
    "tags": [
      "Android Development"
    ]
  },
  "TCT-1480": {
    "complexity": "Beginer",
    "speakers": [
      "a14457ee24a86a604c55d6774bed5483b630e78f"
    ],
    "description": "Navigating between screens is pretty simple right? No it’s not. Actually not all the time.\r\nLast year Google introduced Navigation Component tool helping us standardise the design and the implementation of how screens can pass in front of the Android users.\r\n\r\nWe started to use it with my team last summer and we learned a lot about its benefits, and its pitfalls. In this presentation, I'll try to give a feedback about what we learned, what hope you can put in it and what’s not to expect from it.\r\n\r\nHere is an outline of the talk:\r\n\r\n- The Navigation Component tool and API\r\n- Testing your navigation\r\n- Specific use cases\r\n    - Handling multi start points\r\n    - Handling custom transitions and Shared Elements\r\n    - How to handle other entities than Fragments\r\n    - Handling the back navigation\r\n- Implementing the navigation logic\r\n    - 3 examples of implementation patterns we found\r\n    - Alternative example to Navigation Components\r\n- The lib is in alpha, what is it implied by this, for real\r\n- Single or Multiple activities what to choose?\r\n- Integrate nav controller in an existing app\r\n- Conclusion\r\n    - What can it bring to your app?\r\n    - Should we use it?\r\n",
    "language": "English",
    "title": "Navigation Component, feedback from the trench",
    "tags": [
      "Android Development"
    ]
  },
  "TWY-4180": {
    "complexity": "Intermediate",
    "speakers": [
      "2a406d23a849d9691b9bc98d967206996e30b252"
    ],
    "description": "Working with a design system can be hugely rewarding: layouts can be created and modified using shared components. This should result in faster development and consistent designs across the app. But getting there is a slow and painful process.\r\n\r\nWhen implementing a design system you have to make many decisions, like: Where do you start? What actually makes a component? And how flexible should components be? This talk will shed some light on these issues by taking you through Deliveroo's process of adopting the design system in its three Android apps.",
    "language": "English",
    "title": "Consistency is Key - Working with a Design System",
    "tags": [
      "Android Development"
    ]
  },
  "XQT-5940": {
    "complexity": "Beginer",
    "speakers": [
      "cac5b6bc1f05caa67061c64989f324a517735a29",
      "b1e2d11f8669d228ed5dd388540aae23c9b81f27"
    ],
    "description": "English TL;DR: It's a stupid french speaking podcast about leeks  ¯\\_(ツ)_/¯\r\n\r\nSi vous ne savez toujours pas pourquoi \"Poireau\" ou que si mais que vous n'avez pas rigolé à la blague la première fois, ni les 3000 autres fois parce qu'en réalité c'est pas si drôle, avouons le... Alors viendez, ça ne sera toujours pas plus drôle, ni plus intelligent mais vous pourrez dire en sortant: \"Je ne sais absolument pas pourquoi j'ai été voir ça\", et ça, ça n'a pas de prix.\r\n\r\n\r\nPS: Épisode 6 car on sait tous que le 6ème est en réalité le 3ème !",
    "language": "French",
    "title": "Android Leaks @Android Makers - Épisode 6 : Le retour des poireaux",
    "tags": [
      "Android Development"
    ]
  },
  "XEB-2115": {
    "complexity": "Beginer",
    "speakers": [
      "289e5c0e7494a73fc56ebc509dfe5aa9a1d564c2"
    ],
    "description": "Our responsibility as developers is to ship high quality features in a timely manner. But there are many factors which can hinder development: from tightly coupled, untested codebases, to differences between team members in architecture visions and API knowledge, to time pressure. \r\nWe tend to look at app development from one point of view: the code. But the team that writes that code is as important as the code, so we need to work on architecting a good, solid team as well, making sure that we create a common language in the team, a shared vision and an environment where team members learn and communicate freely.\r\n\r\nIn this talk, I’m going to cover some of the lessons I learned along the way and show how we, a team of four, applied them in rewriting Plaid - an open source app, initially created to showcase Material Design. We’ll see how intertwined the code and the team were for the project.\r\n",
    "language": "English",
    "title": "Pragmatic crafting",
    "tags": [
      "Android Development"
    ]
  },
  "XPP-1467": {
    "complexity": "Beginer",
    "speakers": [
      "3e271f509e5ca12cfef7d51e98fde031c124e382",
      "6655ec55dd5d139ccb4d6f8724017c05c51555c3"
    ],
    "description": "Android apps are not just series of static screens. To create a great app you will have to bring it into life with meaningful, helpful and delightful motion.\r\n\r\nHowever, a good design is not worth much unless it gets implemented correctly. In this joint designer-developer talk we discuss the workflow from the idea, to design and development and all the way to user’ hands. \r\n\r\nWe describe when to use motion and when not to as well as selecting the right type and right intensity of motion. We then dive into the best implementation strategies including communicating state, navigation, feedback, tutorial and delightful animations.",
    "language": "English",
    "title": "Meaningful motion design and how to implement it",
    "tags": [
      "Android Development"
    ]
  },
  "WLQ-5551": {
    "complexity": "Beginer",
    "speakers": [
      "786f4ff40c2d8aeef85a8dc997006cae5a4f9dc3"
    ],
    "description": "Deploying an Android app to the play store always contains some cost in it. Furthermore the user isn't always keen to download (again) our latest versioned app. How about doubling the cost of development with the iOS app into account (or Web)?  \r\nAt Square, we came up with a system in which the server owns the workflow of the client. This means the client doesn't know before hand which screen, which image or text it's gonna show next.\r\n\r\nIn this talk, we'll:\r\n\r\n- Know why Square ended up choosing this system.\r\n- Discover how we built it.\r\n- Look at the challenges, the pros and cons of such an architecture.\r\n- Talk about how we want to alter it for the future.\r\n\r\nAttendees to this talk will be expose to solutions for problems every company is facing but don't address.",
    "language": "English or French",
    "title": "Server Driven UI Workflow",
    "tags": [
      "Android Development"
    ]
  },
  "JSD-5161": {
    "complexity": "Beginer",
    "speakers": [
      "6232967f8d0646a8551e28d2923630d719c4c42f"
    ],
    "description": "Vector assets are lightweight and sharp on every screen size, but working with them can be complicated. Android doesn’t directly support SVG, potentially leading to conversion and ownership issues. This talk will cover what designers and developers need to know to work together to create static and animated vector assets. We’ll cover the capabilities of Android’s vector formats, how they influence producing assets in graphics packages (with a focus on Sketch) and how to efficiently export them. We'll also look at tooling and workflows that allow designers and devs to collaborate on creating vector animations.",
    "language": "English",
    "title": "Vector Workflows",
    "tags": [
      "Android Development"
    ]
  },
  "MAW-7262": {
    "complexity": "Beginer",
    "speakers": [
      "289e5c0e7494a73fc56ebc509dfe5aa9a1d564c2"
    ],
    "description": "In this workshop we’ll be looking at coroutines - Kotlin’s way of handling asynchronous programming. We’ll see what they are, how they work, how to call tasks written with coroutines and get the results of the tasks, how to convert existing APIs to coroutines, how to use coroutines in an Android app, especially together with Architecture Components and, finally, see how to test coroutines. \r\n",
    "language": "English",
    "title": "Coroutines, a new scope",
    "tags": [
      "Android Development"
    ]
  },
  "RBP-6855": {
    "complexity": "Beginer",
    "speakers": [
      "14c3b8582f3c1821ba86739393cd027ec8e321c9"
    ],
    "description": "You've been working as an engineer for a while, and now you want more. More responsibilities, more decision making power, more money. But where do you even start? Become an engineering manager right? Not so fast. \r\n\r\nIn this talk, we'll go over how to choose the best career path for *you*. There are many ways of becoming the leader you know you deserve to be, and not all of them are obvious nor conventional. We'll cover the different options and the skills required to get there, but we'll also talk about why *not* to become a manager, or even a tech lead.\r\n\r\nFinally, you decide to make the jump. You \"made it\" right? But, now what? How to become the best leader you can possibly be? How to give constructive feedback? How to set expectations with your people? And what's next? Keep climbing?... or choose to go back to building.",
    "language": "English",
    "title": "Becoming a Leader in Tech: How to boost your career without losing your mind",
    "tags": [
      "Android Development"
    ]
  },
  "KSG-3809": {
    "complexity": "Beginer",
    "speakers": [
      "b90144ca0b7e987da4eac1e6ac116b1f1b2cb6e2"
    ],
    "description": "Sharing code between platforms is a powerful technique, but it may be hard to accomplish without rich APIs that we have in Android, JVM, or iOS platforms. Kotlin Multiplatform libraries can be used to fix that, bringing rich APIs directly in the common Kotlin code. \r\n\r\nWhat an exciting frontier!\r\n\r\nIn this talk we'll go over the creation of a Kotlin Multiplatform library. You'll learn how modules for each platform work, decide what parts of the code makes sense to share and what doesn't. All based in the experiences gathered after creating a library at Mixtiles used to fetch images from different cloud providers.",
    "language": "English",
    "title": "Building a library for Android and iOS using Kotlin Multiplatform",
    "tags": [
      "Android Development"
    ]
  },
  "CRY-8750": {
    "complexity": "Beginer",
    "speakers": [
      "f0b60b05124ad1a0b3e76cca09dd215645931221"
    ],
    "description": "Have you dreamed of deliciously sweet animations in your app but have no idea where to start? 🍫 What about creating some delightful UI treats to keep your users intrigued and wanting to discover more? 🍦\r\nJoin Rebecca on this journey into a World of Pure Android Animation ✨.  From creating custom view animations on a Canvas to using MotionLayout to create complex layout animations, there is something for everyone. We will also see how to create your own AnimatedVectorDrawable using Shape Shifter. No golden ticket required. ",
    "language": "English",
    "title": "In a World of Pure Android Animation  🍭🍫",
    "tags": [
      "Android Development"
    ]
  },
  "OVK-2477": {
    "complexity": "Intermediate",
    "speakers": [
      "7995936e8a151a29c1a6fa72ac7db5ae373b201d"
    ],
    "description": "In this talk, we will learn how to build an application with the ARCore Android SDK. We'll start with a quick look at physically based rendering, and how to find or create these 3D models. \r\n\r\nThen we'll learn the basics of adding virtual objects and interfaces to our environment, using the Sceneform library. \r\n\r\nWe'll close with Cloud Anchors and Augmented Images, which are used to create collaborative and interactive augmented reality experiences.",
    "language": "English",
    "title": "ARCore - Basics and Tools",
    "tags": [
      "Android Development"
    ]
  },
  "AFF-5103": {
    "complexity": "Beginer",
    "speakers": [
      "109d33decd394492fbd5b99a92dd7607d821d27c"
    ],
    "description": "The first question Android developers ask me when they learn that I do talks about the Google Assistant is: *\"OH! I have this awesome app that has this use case and I totally want to integrate it with the Google Assistant so I can do hands-free actions inside my app\"*. This is a genuine question with a complicated answer. \r\n\r\nThere are several tools out there that you can use to address this problem: Dialogflow, TensorFlow (Mobile, Lite), ML Kit, Cloud APIs, Auto ML. The most impressive thing? They're all Google solutions! If you're not confused yet, take a look at Google Maps that \"integrated\" with the Google Assistant when you're in itinerary mode and App Actions that are supposed to help Android developers take advantage of Actions on Google.\r\n\r\nIn this talk, I'm *not* talking about integrating your app with the Google Assistant, but rather how Android developers can add voice actions in their app (not via the Google Assistant). I'll then talk about both ecosystems (Android and Assistant) and how they interact with each other.",
    "language": "English",
    "title": "Integrating Android with the Google Assistant",
    "tags": [
      "Android Development"
    ]
  },
  "DFO-2916": {
    "complexity": "Beginer",
    "description": "Functions that take a long time to return are a problem because they block the calling thread, which could be the main thread, where your UI runs.\r\nYou can workaround this issue by using callbacks instead, but it introduces other issues:\r\n\r\n- Mangled functions signatures\r\n- Inability to use even simple language constructs like `if`, `while` or local variables\r\n- More verbose usage (boilerplate never scales well)\r\n- Harder error/exception handling\r\n\r\nSeeing it brings more problems than it solves helps us understand why people refer to **callback hells**.\r\n\r\nThere's been attempts to circumvent these issues with AsyncTask (no comment), Futures (from JDK, Guava, and more), Tasks API (from Google Play Services), reactive programming (e.g. RxJava used for threading and callbacks), and none solves all the issues mentioned above.\r\n\r\n**Kotlin coroutines are changing the game** with an implementation of the nearly 60 years old concept that **brings back the simplicity of blocking code**, without the blocking issue.\r\n\r\nIn this talk, you'll see how any waiting or blocking code can be made easier to write and read.\r\nYou'll learn how to use kotlinx.coroutines correctly in Android, and peek at how it all works.",
    "language": "English",
    "speakers": [
      "cb2e16407c778831b4f990bfbd556135c507867f"
    ],
    "title": "Making any codebase more readable with Kotlin coroutines",
    "tags": [
      "Android Development"
    ]
  },
  "SCS-0941": {
    "complexity": "Beginer",
    "speakers": [
      "be0712870b4c90334f276a529f5a8f3fcebe50da"
    ],
    "description": "Kotlin changed the way we code!\r\nBut did you already adapt the way you test?\r\nThe language offers new possibilities but also offers challenges, just think of Coroutines.\r\nLet's write nice and clean Kotlin tests together.\r\n",
    "language": "English",
    "title": "Effective Unit testing with Kotlin",
    "tags": [
      "Android Development"
    ]
  },
  "VUR-7482": {
    "complexity": "Beginer",
    "speakers": [
      "855a1af7d899d1dd7bfe11b340f628fe70ef54a9"
    ],
    "description": "Even among machine learning experts, we have encountered many myths about on-device machine learning:\r\n1. Android is not powerful enough for machine learning\r\n2. Machine learning is not for me, it’s for people with PhDs\r\n3. Machine learning requires a lot of data - millions and billions of samples.\r\n\r\nIn this talk, Hoi will bust some myths with live demos and introduce best practices for developers to get around the reality of building everyday ML use cases including barcode scanning, AR stickers and more, on Android. Also, some core Android functionalities might surprise you… in a good way.\r\n",
    "language": "English",
    "title": "Myths and Reality of Android Machine Learning",
    "tags": [
      "Android Development"
    ]
  },
  "AMU-5195": {
    "complexity": "Beginer",
    "speakers": [
      "fb805760b311d7dea7963afcd97f9613303f7722"
    ],
    "description": "After TensorFlow Lite, MLKit  promises to be our new tool to make our apps smarter. The possibility to integrate our model directly on Firebase is crazy, but the second part (often put aside) deserves our attention.\r\nBased in majority on deprecated Mobile Vision, the few models offered by Google already give us something to enjoy. Most of them is available offline: so we can imagine the extent of the possibilities!\r\n\r\nCome with me to discover these APIs: how and why to use them.\r\n\r\nApres TensorFlow Lite, ML Kit s’annonce être notre nouvel outil pour rendre nos apps intelligentes. La possibilité d’héberger nos modèles sur Firebase est déjà folle, mais la seconde partie (souvent vite vu) mérite notre attention. \r\nBasée en grande partie sur feu-Mobile Vision, les quelques modèles proposés par Google nous donnent déjà de quoi nous amuser. La plupart sont disponible offline: on peut donc imaginer l’étendue des possibilités!\r\n\r\nJe vous propose de m’accompagner dans la découverte de ces API: comment et pourquoi les utiliser.\r\n",
    "language": "English or French",
    "title": "Do you want an easy way to add Machine Learning into your app?",
    "tags": [
      "Android Development"
    ]
  },
  "QIW-9288": {
    "complexity": "Intermediate",
    "speakers": [
      "8f68e78b32a10a76333bab554eb2ad6532d0aa50"
    ],
    "description": "Until now, in order to perform background work in Android, developers had to choose between multiple execution options. At Google I/O 2018, the Android team launched WorkManager as part of the Android Jetpack. This library provides a simple and clean interface to specify deferrable, asynchronous tasks and when they should run.\r\nThe presentation will include an overview about the existing background solutions, what’s happening behind the scenes and why and when we should use WorkManager. Also, we will discover details about the architecture of the WorkManager library and about the main components(Worker, WorkRequest, WorkManager, WorkInfo) of it. Finally, we will highlight how to use WorkManager for scenarios like chained sequences of tasks that run in a specified order, unique named sequences, tasks that pass and return values and how to apply constraints in order to decide when to run the task.",
    "language": "English",
    "title": "Workout your tasks with WorkManager",
    "tags": [
      "Android Development"
    ]
  },
  "XQK-8719": {
    "complexity": "Beginer",
    "speakers": [
      "7c3c8d4952ab519203050d818cb1f3d6193ec605"
    ],
    "description": "*Vector-drawables, 9 Patches, layer-list, multi-densities, screen sizes*: Android provides many ways to use graphical resources in an application and deal with the fragmentation. The goal of this talk is to take a tour of the available resources that developers can use in their application, see what tools Android Studio provides to manage those resources, how these resources are embedded into the APK and what how the framework uses them at runtime.",
    "language": "English",
    "title": "A resourceful talk about Android Resources",
    "tags": [
      "Android Development"
    ]
  },
  "RBU-3913": {
    "complexity": "Beginer",
    "speakers": [
      "c51d1bb67a1dc86f27d7e9db63baae388dba5816",
      "78c3edf266c08db4ad6c86f2019ab7b7fb1082f4",
      "bb6d8ab858c76a2ae9bd19825398562f8c36b3d5"
    ],
    "description": "What’s that Flutter everybody in mobile development is talking about these days? Another new thing that will be forgotten by this time next year or a true revolution in mobile apps development? Is it really worth my time?\r\n\r\nFlutter is Google's mobile SDK for crafting high-quality native interfaces on iOS and Android in record time. Flutter works with existing code, is used by developers and organizations around the world, and is free and open source.\r\n\r\nBeyond the commercial pitch, in this codelab you will create a simple Flutter app and discover the features that make Flutter one of the most pleasant and productive development platform.\r\n\r\nYou need to bring your own laptop and validate the following steps :\r\n\r\n* https://flutter.io/docs/get-started/install\r\n* https://flutter.io/docs/get-started/editor\r\n* https://flutter.io/docs/get-started/test-drive\r\n\r\nThe demo app is running on your simulator? Let's go with Flutter!!!\r\n\r\nNB: We can speak in French or in English.",
    "language": "English or French",
    "title": "Write your first Flutter App",
    "tags": [
      "Android Development"
    ]
  },
  "NIZ-9897": {
    "complexity": "Beginer",
    "speakers": [
      "76bf11899131efa3b3d975aa262c6c4a374e4dcf"
    ],
    "description": "Android is not only for regular mobile apps - it can be used to make self-service Kiosks as well. \r\n\r\nYou will learn from my experience of leading the development of Android-based self check-in Kiosks about the challenges of locking the system to run single app and blocking any security holes or stability issues.  You'll learn about how to architect the remote maintenance and management infrastructure for Android-based single-purpose applications in a mission-to-Mars autonomous environment and what to expect from Google's new Android Management API (now in BETA). We'll talk not only about the software, but also about the hardware and UI/UX side of creating Kiosks and the unexpected challenges and bottlenecks ahead. You'll leave the talk knowing about the peculiarities of the emerging field of COSU (company owned single use) devices and will be prepared to tackle them heads on when having your next Kiosk project on Android. ",
    "language": "English",
    "title": "Locking, blocking and rocking Android for Self-service Kiosks",
    "tags": [
      "Android Development"
    ]
  },
  "TGV-6847": {
    "complexity": "Beginer",
    "speakers": [
      "469f96c27458e9ea274351d9be8402ad54b4c803"
    ],
    "description": "Is your team not reviewing code? You should be! Does it feel like you could be getting more out of code reviews? Absolutely! Code reviews are severely underutilized.  Let me show you some approaches to get more value from code reviews for you and your team.  \r\n\r\nI will emphasize code review best practices starting with why you should be performing code reviews.  Some teams don't perform reviews and this is really hurting them in the long run. I will attempt to sell the review process and explain why it is fundamental to our roles as developers.  \r\n\r\nTeams that are performing reviews may feel burdened by doing so and see it as chore. This also is not ideal and I will dig a little deeper and discuss why we feel this way sometimes. What are the strategies to overcome this feeling? Is it possible to enjoy code review?\r\n\r\nAre there shortcuts to work more efficiently at reviewing code? Absolutely! Can some things be automated? What can't? Let me show you some great approaches to making the review process streamlined and efficient. \r\n",
    "language": "English",
    "title": "Getting the most out of code review",
    "tags": [
      "Android Development"
    ]
  },
  "ZDM-8801": {
    "complexity": "Beginer",
    "speakers": [
      "d2465df643f7c6cc758eda0bd047621e2ffddaa6"
    ],
    "description": "Une fois rentré dans l’industrie du développement, les challenges de code restent souvent un lointain souvenir des études, ou dans le meilleur des cas des exercices d’entretien que l’on connait par coeur. \r\n\r\nCes défis ont pourtant participé à forger notre passion pour l’informatique, ainsi qu’à nous initier à des concepts d’algorithmie et de structure de données, et parfois même à nous offrir nos premiers pas dans un langage. Des connaissances qui contribuent aujourd’hui à la qualité de notre travail. \r\n\r\nCurieux de voir ce que ces défis peuvent encore apporter à nos équipes de développeurs, nous nous sommes organisés pour participer collectivement au challenge adventofcode.com.\r\n\r\nAdvent of Code est-il un bon moyen pour s'initier à un nouveau langage comme Kotlin ? Cet exercice personnel peut-il s’inscrire dans une dynamique d’équipe ? Ces challenges ont-ils encore des choses à nous apprendre ?\r\n\r\nJe vous propose de partager tous les enseignements accumulés durant ce mois un peu fou, et qui sait, peut-être cela vous incitera-t-il à tenter l’aventure dans votre entreprise ? ",
    "language": "French",
    "title": "Embarquez dans l'aventure Kotlin avec Advent Of Code",
    "tags": [
      "Android Development"
    ]
  },
  "NYI-1720": {
    "complexity": "Intermediate",
    "speakers": [
      "6352b1f89b94a70cb615c7e6ec9af9b97f5e7e16"
    ],
    "description": "`Android` developers are facing a common problem: how to test our applications on many devices without sacrificing too much time or money?\r\n\r\n    How to build and test automatically our applications for each commit?\r\n    How can we find those devices inside the company, whatever its size may be?\r\n    Could there be a directory somewhere that lists those available devices?\r\n    Could we use a device remotely and share it with other developers as if it were in the cloud?\r\n\r\nWhat if you could answer all these questions with the help of a low cost device farm that fits into a pocket? A pocket full of clouds…\r\n\r\nPoddingue, our proposal, aims to tackle this problem thanks to Docker, HypriotOS, Armbian, Gitlab CI and OpenSTF. It’s an internal solution made of OSS readily available, but it has not yet been publicly announced as a whole.\r\n\r\nThis is a feedback about an idea on its way to production, a long journey full of different feelings.\r\n\r\nAt the end of the talk, you should know how to build your own cloudy pocket farm of Android devices and how to use it to test your applications within your ci pipeline.\r\n\r\nAnd as I am cheap, you will also be surprised at how little money you need to build it.",
    "language": "English or French",
    "title": "The Android device farm that fits in a (cloudy) pocket",
    "tags": [
      "Android Development"
    ]
  },
  "KOV-9403": {
    "complexity": "Intermediate",
    "speakers": [
      "5978cd774e924d51f2923d8620f1346a3392263c"
    ],
    "description": "Animations bring your app to life but often we write them as pre-canned sequences that once started can’t be interrupted or redirected. Modern Android apps are reactive to state changes… your animations should be as well. This talk looks at techniques for writing animations that work like state machines, that can be interrupted or retargeted while running. We’ll look at ways to architect your animations to achieve this, and libraries and classes that we can utilize.",
    "language": "English",
    "title": "Motional Intelligence: Build smarter animations",
    "tags": [
      "Android Development"
    ]
  },
  "comedy": {
    "complexity": "Beginer",
    "speakers": [
      "379c162aac12eca2deca690287b54ad270cc2e40",
      "4a7ca4c16cbe81a612bf3011a3d3439f85408103"
    ],
    "description": "",
    "language": "English",
    "title": "Closing conference",
    "tags": [
      "Android Development"
    ]
  },
  "BXQ-5942": {
    "complexity": "Intermediate",
    "speakers": [
      "577e9daa13bf52cf00a48a6304fc2332e060d73d"
    ],
    "description": "Android is a marvelous platform that has been evolving for more than 10 years now. Having such a large framework and so many APIs, some of thme comes with their questions and puzzlers. In this talk, we will present some of the weirdest API usage/results and give an explanation for each of them.",
    "language": "English",
    "title": "Android Puzzlers",
    "tags": [
      "Android Development"
    ]
  },
  "QMW-7145": {
    "complexity": "Expert",
    "speakers": [
      "96c6201599b5aea0e119a60ab9ebbf185be421b5"
    ],
    "description": "If you’ve used Firebase Performance Monitoring, you know that it automatically discovers and reports performance metrics for all the HTTP transactions in your app.  But have you ever wondered how it does that?  Android doesn’t provide any APIs to listen in on an arbitrary connection (that would be a security problem!), and Firebase supports URLConnection, Apache, and OKHTTP APIs.  The secret here is bytecode manipulation at build time using the Transform API provided by the Android build tools.  Join this session to find out how the Firebase Performance Monitoring Gradle plugin intercepts and measures HTTP transactions at runtime with some assistance from bytecode manipulation at build time.\r\n",
    "language": "English",
    "title": "(Android) Transformers - bytecode in disguise!",
    "tags": [
      "Android Development"
    ]
  },
  "VOJ-6007": {
    "complexity": "Beginer",
    "speakers": [
      "d2a0ee8397721dab722a6f969532df215dad171c"
    ],
    "description": "You want to style the title of dialogs throughout your app and you think it should be simple enough. However, once you dive into it, you might start asking questions - should I use alertDialogTheme or alertDialogStyle? Should I use windowTitle or dialogTitle? It is no secret that the styling and theming system in Android is complex, but I promise there is some method to the madness! We can avoid writing custom components just to achieve pixel perfection if we know how tame to the beast.\r\n\r\nIn this talk, we will learn about the difference between themes and styles, the hierarchy of different styling techniques and how to use them effectively. We will also learn how they work internally, and the best practices of how to apply them. We will wrap up by discussing the newest app theme in town - the Material Components Theme and the attributes that come with it, like “colorOnSurface”.  \r\n\r\nAt the end of this talk, you will know how to style your app like a pro with the correct use of Styles, Themes, TextAppearance and sensible defaults while specifying colour, shape and typography through Material Theming.\u2028",
    "language": "English",
    "title": "Styles, Themes, Material Theming, Oh My!",
    "tags": [
      "Android Development"
    ]
  },
  "MKQ-2052": {
    "complexity": "Intermediate",
    "speakers": [
      "7d6c66f700e20f82bdfa02c954a83d13f05d63df"
    ],
    "description": "Data binding is great for eliminating boilerplate and keeping UIs in sync with your state… but there's a lot more that it can do. This talk will take you through the more advanced features of Data Binding, beyond the basics. It will cover using custom binding adapters, two-way binding, animations and testing considerations. Moreover it examines how using Data Binding influences your app's architecture. You'll learn how to get the most out of Data Binding so that you can write less repetitive, safer, efficient apps.",
    "language": "English",
    "title": "Advanced Android Data Binding",
    "tags": [
      "Android Development"
    ]
  },
  "GAO-2888": {
    "complexity": "Beginer",
    "speakers": [
      "822864bbbee048b2f933cbe80197c80b36e291a3"
    ],
    "description": "In this talk, you will learn about best practices to gather insights,  mixed with real life experiences and anecdotes. Understand why people are doing certain tasks, not only what they are doing. \r\nBasically, improve your apps, by asking the right questions.\r\n\r\nNo budget for user research? Learn what you can do under the radar to understand the user behaviour better. You will get examples on how it can be done, regardless if you are a bigger company, or an indie developer! ",
    "language": "English",
    "title": "The difference between what and why.",
    "tags": [
      "Android Development"
    ]
  },
  "HJM-2968": {
    "complexity": "Beginer",
    "speakers": [
      "a14457ee24a86a604c55d6774bed5483b630e78f"
    ],
    "description": "A bunch of Google Developers Experts will come on stage, discovering a few applications in live, they will provide feedback and advices to the developers.\r\nPropose your application for the review by sending the Play Store link or the APK to contact@androidmakers.fr",
    "language": "English",
    "title": "App Clinic",
    "tags": [
      "Android Development"
    ]
  },
  "VQS-5461": {
    "complexity": "Intermediate",
    "speakers": [
      "bee9073d3e8e1f966338d0cf74c4d34708270008"
    ],
    "description": "Writing multi-threaded software is hard. Debugging and chasing down problems like deadlocks, race conditions, and memory leaks is even harder.\r\nKotlin takes a different approach. It doesn't have to be so hard. Learn how you can write concurrent and asynchronous software using coroutines. And stop sharing memory to communicate mutable data. Leverage channels to safely communicate across coroutines.",
    "language": "English",
    "title": "Concurrency doesn't have to be hard: Kotlin Coroutines and Channels",
    "tags": [
      "Android Development"
    ]
  },
  "ODA-3499": {
    "complexity": "Beginer",
    "speakers": [
      "ebe349a84d93b180def160c8a4731efd3b4a44f4"
    ],
    "description": "Do you exactly know what's your app doing when you deliver it to your users? Are you 100% sure? Would you bet on this? You're probably confident with the code you wrote and you know what is doing. \r\n\r\nBut what about the code that others wrote? \r\n\r\nWe pull dependencies from the online repositories every day. Our applications strongly rely on external libraries that are hosted on public Maven repositories. What if one of those library contains some malicious code? Imagine a library that starts harvesting your user data without you knowing it.\r\n\r\nIn this talk we will see how to monitor and protect your application from malicious dependency on the web that might end up in your final compiled App.",
    "language": "English",
    "title": "I have no idea what my app is doing ¯\\_(ツ)_/¯",
    "tags": [
      "Android Development"
    ]
  },
  "HXB-5769": {
    "complexity": "Intermediate",
    "speakers": [
      "5bdfb67feee7e1b26c4a99834b480ecbd8318405"
    ],
    "description": "Que l’on développe une application pour smartphones ou pour un IoT, la connectivité est un élément clé. Idéalement, on voudrait à la fois minimiser la latence et la consommation d’énergie. Concrètement, c’est difficilement faisable. En balayant tout un tas de technos, du WiFi à LTE-M, en passant par la 2,3,4,5G, nous verrons les mécanismes qui sont mis en place pour préserver l’autonomie d’un appareil et qui inévitablement induisent de la latence.",
    "language": "French",
    "title": "Energie, latence: je t'aime, moi non plus",
    "tags": [
      "Android Development"
    ]
  },
  "XVO-2305": {
    "complexity": "Intermediate",
    "speakers": [
      "f58390d96ca39df86db9d7d5a3c5a237261b7c18"
    ],
    "description": "Recruter des talents dans le marché de l'informatique relève aujourd'hui de la gageure, et le déséquilibre entre l'offre et la demande entraîne une forte concurrence entre les entreprises.\r\n\r\nQuelles sont les clés pour maximiser les chances de recruter la personne que vous voulez :\r\n\r\n- Vaut-il mieux débusquer un _senior_ quitte à le payer très cher, ou investir sur un _junior_ ? Et comment le former le cas échéant ?\r\n- Que recherchent vraiment les candidats dans votre société, petite ou grande, et comment faire valoir vos atouts ?\r\n- Quels sont les médias disponibles pour rechercher des candidats, et comment sortir du lot sur les réseaux ?\r\n- Quels sont les points d'attention pendant le processus de recrutement ?\r\n\r\nNous tenterons d'aborder l'ensemble de ces questions en apportant des réponses circonstanciées - basées sur des exemples et des chiffres - et nous nous efforcerons de montrer que le recrutement d'un bon développeur est encore possible de nos jours.",
    "language": "French",
    "title": "Recruteurs, développeurs, bonne humeur",
    "tags": [
      "Android Development"
    ]
  },
  "IVS-2334": {
    "complexity": "Intermediate",
    "speakers": [
      "ef8733e13308cd31795794c16320420436c045a9"
    ],
    "description": "A core use-case for Facebook for Android is scrolling through a feed of autoplaying videos. We've needed to have a deep understanding of video playback to optimize performance in our apps.\r\n\r\nIn this talk, we’ll examine the details behind video playback on Android. We’ll look at the actors that play a role in delivering decoded video pixels to the screen. We’ll go beyond the high-level MediaPlayer / ExoPlayer components and examine what's happening in the system. Understanding how video playback works under the hood can help you figure out how to get the best performance for your applications.\r\n\r\nWe’ll cover the details behind fundamental graphics components used by video rendering: e.g. SurfaceView, TextureView, SurfaceTexture, etc. These components also enable more complex media rendering such as 360 videos, 3D scenes, and AR experiences.\r\n\r\nWe hope to leave you empowered to look deeper into the Android system beyond the high-level Android framework components and expand your knowledge and expertise.",
    "language": "English",
    "title": "Rendering Video: A Detailed Look at Video Playback on Android",
    "tags": [
      "Android Development"
    ]
  },
  "LNH-0175": {
    "complexity": "Intermediate",
    "speakers": [
      "e8187155eb33d38ede094437f68e66e4fb961811"
    ],
    "description": "Wind back one year ago:\r\n- releasing took us 10 weeks\r\n- our app was plagued by regression\r\n- developers felt completely detached from our users\r\n\r\nClearly our traditional strategy of heavily testing each release (up-front quality) wasn't working. So we decided to flip things around: why not try to reduce the cost of errors instead? Hence we decided to move our Philips Hue Android app to continuous deployment.\r\n\r\nIn this talk you will learn that if releasing is painful, you should actually release even more often. Step by step I'll explain how we moved the Philips Hue Android app to continuous deployment, what our current release process/CI looks like, what changes we made to our overall testing approach, how we empowered developers and testers, and how we made our release process completely painless.",
    "language": "English",
    "title": "Journey to painless releases: Continuous delivery for Philips Hue Android",
    "tags": [
      "Android Development"
    ]
  },
  "LQF-6083": {
    "complexity": "Beginer",
    "speakers": [
      "115f4a6f8cecc960e8936c3d4429d26004083556"
    ],
    "description": "We Android developers love desert. We love pie. We can't eat up a whole pie, but we can eat as many slices as we want.\r\nAndroid has a new API called Slices which is part of the AndroidX libraries. I'll show you how you can use it to serve slices of your app to any other apps like Google Search or Assistant but also any other app and in any Android desert you love.\r\n",
    "language": "English or French",
    "title": "Slices up your app!",
    "tags": [
      "Android Development"
    ]
  },
  "HZY-9508": {
    "complexity": "Intermediate",
    "speakers": [
      "de70b5c556753d7ea84b24cf96b188e82d2e84ef"
    ],
    "description": "Many teams are designed so that engineers can take an abstract view of the customer and focus on implementation. But when the customers are other engineers, that entire dynamic is thrown on it's head.\r\n\r\nIn this talk, Ty will walk you through the best practices of building great products for developers, from team processes to the technical delivery.\r\n\r\nTopics covered will include: Building customer personas and product strategies, Developer Experience research and analytics, customer empathy and support structures, API Design and usability, testing, code distribution, and creating great documentation.",
    "language": "English",
    "title": "Building for Developers",
    "tags": [
      "Android Development"
    ]
  },
  "EHB-6826": {
    "complexity": "Intermediate",
    "speakers": [
      "0f5e9b36c145d15e6f4e60b330f978dfe843731a"
    ],
    "description": "You're right, that title seems scary: there are so many complicated words and we all know there's no silver bullet in programming.\r\n\r\nSo instead of explaining why an architecture is better than another, let's discuss some issues we face in our daily Android development job and how we can solve those through 3 examples:\r\n\r\n1. I have crashes I can't reproduce.\r\n2. Integration tests are great and necessary to ensure a complete flow is working as expected, but they are complex to set up, and it takes time to run the whole test suite when using an instrumentation tool such as Espresso\r\n3. My legacy app has some \"startActivity\" calls in activites, fragments, custom views, and even in RecyclerView adapters (who did that !?!). I have no visibility regarding the overall navigation of and the code is sometimes hard to follow.\r\n\r\nWe will see today the concepts underneath and how such an architecture can be implemented using functional programming patterns through writing a Kotlin DSL.\r\n\r\nAt the end of the talk, you will get a new, fresh, vision on how to approach programming on Android, through a unidirectional data flow structure, and maybe you'll be interested in implementing a similar architecture.",
    "language": "English or French",
    "title": "The Rise Of The State Machines: An introduction to predictable state container based architectures for your Android apps",
    "tags": [
      "Android Development"
    ]
  },
  "JJK-6338": {
    "complexity": "Intermediate",
    "speakers": [
      "6ce3af5e301140503905b5496e0a2294e0d649fe"
    ],
    "description": "One of the stated goals of Android Architecture Components is to make it easier for developers to manage the lifecycle of application components. However, when looking at the full picture of combining configuration changes and background memory constraints with static and dynamic state, the basic examples provided in the documentation begin to show their limitations. A more in-depth exploration is needed.\r\n\r\nWe'll look at how to combine bundles and view models to fully persist the state of the application during its lifecycle. Using coroutines for concurrency, we'll see how dynamic state restoration can be achieved.\r\n\r\nGoing over increasingly complex examples of state restoration constraints, we'll see how our implementation of state restoration grows and evolves.",
    "language": "English",
    "title": "State Restoration - The full Picture (With Coroutines)",
    "tags": [
      "Android Development"
    ]
  },
  "PJX-9369": {
    "complexity": "Beginer",
    "speakers": [
      "e3d707eac34855001324081f4355fbb6c4c4a0ad"
    ],
    "description": "Quand on parle d’accessibilité, on pense automatiquement aux rampes d’escaliers, ou aux places de parking. Mais qu’en est-il de l’accessibilité des applications mobiles ?\r\nCette présentation fera un tour des préconisations aussi bien UX/UI que techniques. Comment savoir si je dois utiliser un contentDescription ou un labelFor, quelle est la taille idéale des cibles tactiles (d'ailleurs c’est quoi une cible tactile ?), quels indices rajouter à mes interfaces, quel ratio de contraste de couleur ? LTR vers RTL, comment gérer ? Comment utiliser TalkBack ? Et toutes ces questions que l’on peut se poser (ou que l’on ne s'est pas encore posées) légitimement.\r\n\r\nRappelez-vous de Gandalf qui se cognait partout dans la petite maison de Bilbon Sacquet, le hobbit. La maison conçue pour des Hobbit par des Hobbit, n’était pas du tout adaptée à Gandalf qui faisait  votre taille.\r\nQuand on conçoit / développe une application, cela ne demande pas plus d’effort de cibler un plus large public…encore faut-il savoir comment.\r\n\r\nCe talk est justement pour tous ceux qui souhaitent en savoir plus à ce sujet, pour faciliter l'accès à l'information à une plus grande partie de la population.",
    "language": "French",
    "title": "L’accessibilité sur Android en 2019",
    "tags": [
      "Android Development"
    ]
  },
  "VTN-7485": {
    "complexity": "Intermediate",
    "speakers": [
      "370e6c635f61bb5c39e82f411e8a639d0fdaf7ce"
    ],
    "description": "Comment créer un système capable de stocker et partager des fichiers de manière sécurisée dans une architecture Zero-Knowledge (sans faire confiance aux serveurs) ?\r\n\r\nComment gérer le chiffrement de fichiers volumineux et les droits d'accès distants ? Quelles sont les principales limitations ? etc...\r\n\r\nAu travers d'un projet concret (aujourd'hui utilisé par des millions d'utilisateurs), il vous sera détaillé l'architecture choisie et les détails techniques permettant son implémentation côté client et serveur.\r\n\r\n",
    "language": "English or French",
    "title": "Stockage et partage sécurisé de fichiers volumineux",
    "tags": [
      "Android Development"
    ]
  },
  "ZCO-9565": {
    "complexity": "Beginer",
    "speakers": [
      "48dedc7f7959765bcb75a87297c7232d70a317ee"
    ],
    "description": "La plupart d'entre vous connait le développement et le cycle de vie des applications Android.\r\nCependant, savez-vous quels mécanismes sont mis en oeuvre par Android pour isoler les applications les une des autres?\r\nVoyons ensemble tout ces mécanismes qui permettent de sécuriser l'OS mobile le plus utilisé au monde.\r\n",
    "language": "French",
    "title": "Le sandboxing applicatif d'Android",
    "tags": [
      "Android Development"
    ]
  },
  "GMB-7169": {
    "complexity": "Beginer",
    "speakers": [
      "00c74c65d0b0d9a25494245a768c5c3b9fcedd2a"
    ],
    "description": "On vous demande de coder une *vue custom* ? Peur de l'inconnu, le mot canevas fait peur à entendre, n'ayez crainte, c'est beaucoup beaucoup plus compliqué sur papier que ça ne l'est dans le code !\r\n\r\nNous apprendrons ensemble : \r\n- comment utiliser les classes Canvas et Paint\r\n- comment dessiner des vues simples : Rectangles, Ronds\r\n- comment dessiner des vues un peu plus complexes : RoundRect, Triangles\r\n- comment animer notre vue custom",
    "language": "French",
    "title": "S’il te plait, dessine moi une vue",
    "tags": [
      "Android Development"
    ]
  },
  "JOO-6049": {
    "complexity": "Beginer",
    "speakers": [
      "6f31d29fa5a6aa10cae357cd9c1125f6018bc9ce"
    ],
    "description": "Koin (https://insert-koin.io) is a pragmatic dependency injection framework for Kotlin/Android developers. Let's see how it will make your life easier thanks to the power of Kotlin language: from basics to the setup of Android architecture's components, without forgetting the testing part...  And of course, how to migrate your \"old\" Dagger project. \r\n\r\nAt the menu also, the presentation of the new 2.0 release and some advanced APIs!",
    "language": "English",
    "title": "Dependency injection from zero to hero with Koin",
    "tags": [
      "Android Development"
    ]
  },
  "NOG-9878": {
    "complexity": "Beginer",
    "speakers": [
      "a1ffbd4128a49788bb27672ad70bed1233dd1d66"
    ],
    "description": "Lorsque l'on travaille sur une application mobile, on se focalise surtout sur l'architecture, l'implémentation des fonctionnalités et éventuellement le design.\r\nOr lorsque l'on travaille dans une entreprise avec un département Marketing, ou simplement si l'on veut optimiser l'usage d'une app, nous sommes systématiquement confrontés à l'implémentation des analytics dans notre code. Et cela peut vite tourner au cauchemar si l'architecture de l'application n'y est pas préparée ou si le plan de tag n'est pas bien pensé. Nous verrons ici comment bien architecturer son app pour pouvoir les ajouter sans _tordre_ son code mais également comment bien définir les évènements et valeur à remonter.",
    "language": "French",
    "title": "Les analytics c'est bon, mangez-en !",
    "tags": [
      "Android Development"
    ]
  },
  "ZPO-7428": {
    "complexity": "Intermediate",
    "speakers": [
      "0e8d0e049c4950ba8b15e76897680e14b6101a1d",
      "70987167704d4d09a43b16f559b4d354389bbb46"
    ],
    "description": "Grâce à Kotlin/Native, disponible en version 1.0 depuis octobre, il est désormais possible d’utiliser Kotlin pour créer nos applications back et mobile natives en utilisant un même langage. Mais, en 2019, est-ce déjà une solution réellement viable ? Dans ce talk, nous allons vous présenter un retour d’expérience sur la création de notre application : de la création des Web Services avec Ktor aux clients iOS et Android, en passant par l'industrialisation et les tests.\r\n\r\nLe futur du développeur mobile serait-il full-stack ?",
    "language": "French",
    "title": "Kotlin end to end: du client au serveur",
    "tags": [
      "Android Development"
    ]
  },
  "XWA-9893": {
    "complexity": "Intermediate",
    "speakers": [
      "93dc8e02bdf1513b877ea04d8d94b83ca00d116c"
    ],
    "description": "Si, il y a 10 ans, à cause d'un écosystème encore en construction, HTTPS était un protocole complexe à mettre en place, aujourd'hui il semble que c'est l'inverse.\r\n\r\nRejouons l'histoire pour découvrir et comprendre ensemble les différentes failles de sécurité qui ont poussé le Web à passer sur HTTPS ainsi que les implémentations associées sur Android.\r\n\r\nÀ travers du code et des analyses, implémentons, cassons et sécurisons ensemble du code réseau pour comprendre comment nous en sommes arrivés aux implémentations actuelles.\r\n\r\nNous découvrirons ensuite les limitations de 2019 : pouvons-nous empêcher tout le monde d'analyser notre traffic ? Qu'est-il possible de faire aujourd'hui, quels sont les risques pour l'utilisateur, le développeur, l'entreprise ? Quels sont les outils et bonnes pratiques pour empêcher ou au moins ralentir et complexifier nos analyses réseau par des personnes malicieuses ?",
    "language": "English or French",
    "title": "Sécuriser ses appels réseau Android, de 2009 à 2019",
    "tags": [
      "Android Development"
    ]
  },
  "HDV-6804": {
    "complexity": "Intermediate",
    "speakers": [
      "d4af9db15742ba17b73c3ad1f57821e25e15983f",
      "ccf70cece5f637610324d4a4fa188ddfdb5aaa03"
    ],
    "description": "Oui, on le sait : vous en avez assez des talks d'architecture mobile. On vous comprend, vous avez dû en voir des tonnes : utiles, superflus, simples, alambiqués, certains même imprononçables et là vous n’en pouvez plus.\r\n\r\nMais donnez-nous une chance : cette fois-ci nous voulons vous présenter une architecture que nous apprécions véritablement : simple, robuste, facilement testable et tirant profit des langages modernes comme Kotlin et Swift - Model-View-Intention. Inspirée de Redux, mais adaptée aux applications mobiles, MVI se sert d'immutabilité, flux de données unidirectionnel et binding pour faciliter débogage et testing et améliorer donc votre productivité. Applicable à Android et iOS, elle permet aussi de simplifier les échanges entre les équipes de développeurs d'applications mobiles natives.\r\n\r\nNous vous présenterons les éléments clés de l'architecture, sa mise en place, ainsi que l'implémentation des cas d'usage les plus communs, issus d'applications que nous avons réellement développées.",
    "language": "French",
    "title": "MVI : une architecture robuste et moderne",
    "tags": [
      "Android Development"
    ]
  },
  "GBA-2488": {
    "complexity": "Intermediate",
    "speakers": [
      "0131a2bfbcc298b6be2339b868d91f62cda15336"
    ],
    "description": "GraphQL is not new, and REST is still around. Is it already time to switch? What tools can we rely on, as of today? Is the framework ready and suitable for everyone around?\r\nAt The New York Times, we invested heavily on this technology, so much that we actually created a whole new feature around it. Join us to discover the inner depths of GraphQL, how it works and how it can be integrated within a few days. Explore how you can make sure about what you write and test it out. And when it's time to optimize, maybe we can help it!",
    "language": "English",
    "title": "GraphQL in real life",
    "tags": [
      "Android Development"
    ]
  },
  "ZPP-9970": {
    "complexity": "Intermediate",
    "speakers": [
      "4be0e0e99b3e04c7154d73ee45444b80d459f466",
      "1fabaecfc95e03a8dfa95d783d59c0eb8f52900d"
    ],
    "description": "As developers, more often than not, you have access to fast and reliable internet connection, all day long. But the users you target won't. Limited data plans, unreliable network coverage, commuting : those are real obstacle that your users will see daily. This means that network will only be available at some times, and not necessarily when the user wants to interact with your application.\r\n\r\nOur talk will focus on creating a user experience with ‘offline’ being the default working state, and having access to the internet being a bonus for your users. We’ll see how to design your UI/UX to make offline more than an edge case scenario, as well as how to architecture your application, and which tools and libraries can help you to implement it.\r\n",
    "language": "English or French",
    "title": "“Make your app work perfectly offl…” — Connection Interrupted",
    "tags": [
      "Android Development"
    ]
  }
}